package data_structure.basic_7;

public class Array {

	public static void main(String[] args) {
		/*
		  * 배열 (Array)
		  	(1) 배열은 가장 기본적인 데이터구조다.
		  	(2) 배열은 생성시 설정된 셀의 수가 고정되고, 각 셀에는 
		  	    인덱스 번호가 부여된다. 배열을 활용 시 부여된 인덱스를 통해
		  	    해당 셀 안에 있는 데이터에 접근할 수 있다.
		  	(3) 시간 복잡도 
		  		ㄴ 값 가져오기 -> O(n)
		  		ㄴ 값 추가하기 -> O(n)
		  		ㄴ 값 삭제하기 -> O(n)
		  		
		  	(4) 장점 
		  		ㄴ 바로 만들어서 활용하기 쉽다.
		  		ㄴ 더 복잡한 자료 구조의 기초가 될 수 있다.
		  		ㄴ 원하는 데이터를 효율적으로 탐색/가져올 수 있다.
		  		ㄴ 정렬에 용이하다.
		  	(5) 단점
		  		ㄴ 데이터를 저장할 수 있는 메모리 크기가 고정
		  		ㄴ 데이터 추가 / 삭제 방법이 비효율적이다.
		  		ㄴ 구조 재구성 시 정렬하는 방식이 비효율적이다 
		  	(6) 사용하는 경우
		  		ㄴ 엑셀의 스프레드시트 처럼 직사각형 테이블, 수학적 벡터
		  		  및 행렬을 구현하는 데 사용된다.
		  		ㄴ 다른 데이터 구조에서 사용된다.
		  	
		  	
		 */
	}

}
