package data_structure.basic_7;

public class Queue {

	public static void main(String[] args) {
		/*
		  	* 큐(Queue)
		  	(1) 큐는 스택과 비슷하지만 가장 먼저 입력된 요소를 처리하는 
		  		FIFO( First In First Out) 메커니즘이다
		  	(2) 큐는 놀이공원에서 서는 줄과 같이 동작한다. 사람들이 맨 끝에 줄을 서고
		  		맨 앞에서부터 놀이기구에 탑승하는 것과 같다.
		  	(3) 시간복잡도
		  		ㄴ 값 가져오기 -> O(n)
		  		ㄴ 값 추가하기 -> O(1) 
		  		ㄴ 값 삭제하기 -> O(1)
		  	(4) 장점
		  		ㄴ 동적인 메모리 크기
		  		ㄴ 데이터를 받는 순서대로 정렬된다
		  		ㄴ 빠른 런타임
		  	(5) 단점
		  		ㄴ 가장 오래된 요소만 가져온다
		  		ㄴ 한 번에 하나의 데이터만 처리 가능하다
		  	(6) 사용하는 경우
		  		ㄴ 반복적이고 자주 받는 데이터를 비동기적으로 할 때 효율적
		  		ㄴ 음성 데이터 처럼 순서에 민감한 데이터를 처리할 때
		  		ㄴ 프린터 대기열처럼 가장 먼저 입력 받은 데이터를 처리해야 할 때
		  		ㄴ 캐시 (Cache) 구현
		  		 
		  		 
		 
		 */
	}

}
