package data_structure.basic_7;

public class Stack {

	public static void main(String[] args) {
		/*
		 	* Stack( 스택 )
		 	(1) 스택은 순서가 보존되는 선형 데이터 구조 유형이다.
		 	(2) 가장 마지막 요소 ( 가장 최근 요소 ) 부터 
		 		처리하는 LIFO ( Last In First Out ) 메커니즘을 가지고있다.
		 		스택은 쌓여있는 접시 더미와 같이 작동한다. 새로운 접시가 쌓일 때도 맨
		 		위에서 쌓이고 접시를 가져갈 때도 맨 위에서 가지고 가는 것과 같다
		 	(3) 시간 복잡도 
		 		ㄴ 값 가져오기 O(n)
		 		ㄴ 값 추가하기 O(1)
		 		ㄴ 값 삭제하기 O(1)
		 	(4) 장점
		 		ㄴ 동적인 메모리 크기
		 		ㄴ 데이터를 받는 순서대로 정렬된다.
		 		ㄴ 빠른 런타임 
		 	(5) 단점
		 		ㄴ 가장 최신 요소만 가져온다
		 		ㄴ 한 번에 하나의 데이터만 처리 가능하다
			(6) 사용하는 경우
				ㄴ 가장 마지막에 입력된 것을 순차적으로 바로 처리하고 싶을 때 
				ㄴ 브라우저의 뒤로가기
				ㄴ 실행 취소
				ㄴ 재귀
			
			
		 	
		 
		 */
	}

}
